#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БК = БиблиотекаКартинок;
	
	Корень = Новый Массив;
	Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "Справочник", Метаданные.Справочники, БК.Справочник));
	Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "Документ", Метаданные.Документы, БК.Документ));
	Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "РегистрСведений", Метаданные.РегистрыСведений, БК.РегистрСведений));
	Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "РегистрНакопления", Метаданные.РегистрыНакопления, БК.РегистрНакопления));
	Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "РегистрБухгалтерии", Метаданные.РегистрыБухгалтерии, БК.РегистрБухгалтерии));
	Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "РегистрРасчета", Метаданные.РегистрыРасчета, БК.РегистрРасчета));
	Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "БизнесПроцесс", Метаданные.БизнесПроцессы, БК.БизнесПроцесс));
	Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "Задача", Метаданные.Задачи, БК.Задача));
	Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "ПланОбмена", Метаданные.ПланыОбмена, БК.ПланОбмена));
	Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "ПланВидовХарактеристик", Метаданные.ПланыВидовХарактеристик, БК.ПланВидовХарактеристик));
	Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "ПланВидовРасчета", Метаданные.ПланыВидовРасчета, БК.ПланВидовРасчета));
	Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "ПланСчетов", Метаданные.ПланыОбмена, БК.ПланСчетов));
	Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "Константа", Метаданные.Константы, БК.Константа));
	//
	//Корень = Новый Массив;
	//Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "Справочник", Метаданные.Справочники));
	//Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "Документ", Метаданные.Документы));
	//Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "РегистрСведений", Метаданные.РегистрыСведений));
	//Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "РегистрНакопления", Метаданные.РегистрыНакопления));
	//Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "РегистрБухгалтерии", Метаданные.РегистрыБухгалтерии));
	//Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "РегистрРасчета", Метаданные.РегистрыРасчета));
	//Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "БизнесПроцесс", Метаданные.БизнесПроцессы));
	//Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "Задача", Метаданные.Задачи));
	//Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "ПланОбмена", Метаданные.ПланыОбмена));
	//Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "ПланВидовХарактеристик", Метаданные.ПланыВидовХарактеристик));
	//Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "ПланВидовРасчета", Метаданные.ПланыВидовРасчета));
	//Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "ПланСчетов", Метаданные.ПланыОбмена));
	//Корень.Добавить(Новый Структура("Имя, Коллекция, Картинака", "Константа", Метаданные.Константы));
	
	ЭлементыДерева = ДеревоМетаданных.ПолучитьЭлементы();
	
	Для Каждого УзелКорня Из Корень Цикл
		
		СтрокаКорня = ЭлементыДерева.Добавить();
		СтрокаКорня.УзелКореняМетаданных = УзелКорня.Имя;
		СтрокаКорня.Картинака = УзелКорня.Картинака;
		
		Для Каждого ОбъектМетаданных Из УзелКорня.Коллекция Цикл
			
			СтрокаОбъекта = СтрокаКорня.ОбъектыМетаданных.Добавить();
			СтрокаОбъекта.ОбъектМетаданных = ОбъектМетаданных.Имя;
			
			Если УзелКорня.Имя = "Константа" Тогда
				Продолжить;
			КонецЕсли;
			
			//Для Каждого Реквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл				
			//	СтрокаПоля = СтрокаОбъекта.ПоляОбъекта.Добавить();
			//	СтрокаПоля.Поле = Реквизит.Имя;	
			//КонецЦикла;
			//Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл				
			//	СтрокаПоля = СтрокаОбъекта.ПоляОбъекта.Добавить();
			//	СтрокаПоля.Поле = Реквизит.Имя;	
			//КонецЦикла;
			//
		КонецЦикла;
		
	КонецЦикла;
	
	Если ЭлементыДерева[0].ОбъектыМетаданных.Количество() > 0 Тогда
		// Выведем поля для первого объекта. Остальные будут подгружаться динамически при выборе объекта.
		ДополнитьПоляОбъектаМетаданных(ЭлементыДерева[0], ЭлементыДерева[0].ОбъектыМетаданных[0]);
	КонецЕсли;
			
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДеревоМетаданныхОбъектыМетаданныхПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоМетаданныхОбъектыМетаданных.ТекущиеДанные;
	ТекущийУзел = Элементы.ДеревоМетаданных.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ТекущиеДанные.ПоляОбъекта.Количество() = 0 Тогда
		ДополнитьПоляОбъектаМетаданных(ТекущийУзел, ТекущиеДанные);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМетаданныхОбъектыМетаданныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СформироватьТекстЗапросаИЗакрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМетаданныхОбъектыМетаданныхПоляОбъектаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля = Новый Массив;
	Поля.Добавить(Элементы.ДеревоМетаданныхОбъектыМетаданныхПоляОбъекта.ТекущиеДанные.Поле);
	
	СформироватьТекстЗапросаИЗакрыть(Поля);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	СформироватьТекстЗапросаИЗакрыть(Неопределено);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВыделенные(Команда)

	Поля = Новый Массив;
	
	ТекущаяСтрокаУзла = Элементы.ДеревоМетаданных.ТекущаяСтрока;
	ТекущиеОбъекты = ДеревоМетаданных.НайтиПоИдентификатору(ТекущаяСтрокаУзла).ОбъектыМетаданных;
	
	ТекущаяСтрокаОбъекта = Элементы.ДеревоМетаданных.ТекущаяСтрока;
	ТекущиеПоля = ТекущиеОбъекты.НайтиПоИдентификатору(ТекущаяСтрокаОбъекта).ПоляОбъекта;
		
	Для Каждого ТекущаяСтрока Из Элементы.ДеревоМетаданныхОбъектыМетаданныхПоляОбъекта.ВыделенныеСтроки Цикл
		
		Поля.Добавить(ТекущиеПоля.НайтиПоИдентификатору(ТекущаяСтрока).Поле);
		
	КонецЦикла;

	СформироватьТекстЗапросаИЗакрыть(Поля);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ДополнитьПоляОбъектаМетаданных(ТекущийУзел, СтрокаТаблицыОбъектов)
	                
	Если ТекущийУзел.УзелКореняМетаданных = "Константа" Тогда
		Возврат
	КонецЕсли;
	
	ПолноеИмяОбъектаМетаданных = ТекущийУзел.УзелКореняМетаданных + "."
			+ СтрокаТаблицыОбъектов.ОбъектМетаданных;
			
	Реквизиты = РеквизитыОбъектаМетаданных(ПолноеИмяОбъектаМетаданных);
	
	Для Каждого Реквизит Из Реквизиты Цикл
		
		НоваяСтрока = СтрокаТаблицыОбъектов.ПоляОбъекта.Добавить();
		НоваяСтрока.Поле = Реквизит;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитыОбъектаМетаданных(ПолноеИмяОбъектаМетаданных)
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	Реквизиты = Новый Массив;
	
	Для Каждого Реквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
		Реквизиты.Добавить(Реквизит.Имя);	
	КонецЦикла;
	Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл				
		Реквизиты.Добавить(Реквизит.Имя);
	КонецЦикла; 
	
	Возврат Реквизиты;
	
КонецФункции

&НаКлиенте
Процедура СформироватьТекстЗапросаИЗакрыть(Поля)
	
	Узел = Элементы.ДеревоМетаданных.ТекущиеДанные;
	СтрокаОбъекта = Элементы.ДеревоМетаданныхОбъектыМетаданных.ТекущиеДанные;
		
	ТекстЗапроса = СформироватьТекстЗапроса(Узел.УзелКореняМетаданных, СтрокаОбъекта.ОбъектМетаданных, Поля);
	
	Закрыть(ТекстЗапроса);
	
КонецПроцедуры

&НаСервере
Функция СформироватьТекстЗапроса(УзелКореняМетаданных, ОбъектМетаданных, Поля)
	
	ТекстЗапроса = "ВЫБРАТЬ";
	
	Если Не ПустаяСтрока(ОграничениеВыборки) Тогда
		ТекстЗапроса = ТекстЗапроса + " " + ОграничениеВыборки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Поля) Тогда
		
		Для Каждого Поле Из Поля Цикл
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + "	" + ОбъектМетаданных + "." + Поле + ",";
		КонецЦикла;
		
		ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса) - 1); // Удаление последней запятой.
		
	Иначе
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "	*";
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ИЗ";
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "	" + УзелКореняМетаданных + "." + ОбъектМетаданных + " КАК " + ОбъектМетаданных;
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти
