
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Свойство", Свойство);
	Параметры.Свойство("СсылкаНаИзменяемыйОбъект", СсылкаНаИзменяемыйОбъект);
		
	Если СсылкаНаИзменяемыйОбъект = Неопределено Или СсылкаНаИзменяемыйОбъект.Пустая() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Установить(Команда)
	
	УстановитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНаСервере()
	
	Попытка
		
		Результат = Вычислить(Выражение);
		
		ИзменяемыйОбъект = СсылкаНаИзменяемыйОбъект.ПолучитьОбъект();
		ИзменяемыйОбъект[Свойство] = Результат;
		ИзменяемыйОбъект.ОбменДанными.Загрузка = РежимЗагрузкаДанных;
		ИзменяемыйОбъект.Записать();
		
		Сообщения = "Изменение значения выполнено успешно. Новое значение: <" + Результат + ">";
		
	Исключение
		Сообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть(Результат);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

