#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СведенияОбОбработке = РеквизитФормыВЗначение("Объект").СведенияОВнешнейОбработке();
	АктуальнаяВерсия = ДанныеАктуальногоРелиза().Версия;
 
	Элементы.ДекорацияВерсия.Заголовок = "Версия " + СведенияОбОбработке.Версия; 
	Элементы.ДекорацияИнформация.Заголовок = СведенияОбОбработке.Информация;
	
	// Проверка обновления
	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	АктуальнаяВерсияЧислом = ОписаниеЧисла.ПривестиЗначение(СтрЗаменить(АктуальнаяВерсия, ".",""));
	ТекущаяВерсияЧислом = ОписаниеЧисла.ПривестиЗначение(СтрЗаменить(СведенияОбОбработке.Версия, ".",""));
	
	Если АктуальнаяВерсияЧислом > ТекущаяВерсияЧислом Тогда 
		Элементы.ДекорацияОбновление.Видимость = Истина;
		Элементы.ДекорацияОбновление.Заголовок = Элементы.ДекорацияОбновление.Заголовок + АктуальнаяВерсия;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДекорацияGitHubНажатие(Элемент)
	
	ЗапуститьПриложение("https://github.com/shatalxe/QueryConsoleSA");

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОбновлениеНажатие(Элемент)
	
	СсылкаНаСкачивание = ДанныеАктуальногоРелиза().СсылкаНаСкачивание;
	
	Если ПустаяСтрока(СсылкаНаСкачивание) Тогда
		ПоказатьПредупреждение(, "Не удалось скачать актуальную версию обработки");
		Возврат;
	КонецЕсли;

	ЗапуститьПриложение(СсылкаНаСкачивание);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеАктуальногоРелиза();
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Версия", "");
	СтруктураДанных.Вставить("СсылкаНаСкачивание", "");
	
	Сервер = "api.github.com";
	ТекстЗапроса = "/repos/shatalxe/QueryConsoleSA/releases/latest";
	
	HTTPЗапрос = Новый HTTPЗапрос(ТекстЗапроса);
	HTTPСоединение = Новый HTTPСоединение(Сервер,,,,,5,Новый ЗащищенноеСоединениеOpenSSL);   
	
	Попытка
		
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
		
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			СтруктураДанных.Версия = "Не удалось получить информацию об актуальной версии";
		КонецЕсли; 
		
	Исключение 
		
		СтруктураДанных.Версия = "Не удалось получить информацию об актуальной версии";
		Возврат СтруктураДанных;
		
	КонецПопытки;
	
	JSON = Новый ЧтениеJSON;
	JSON.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
	Данные = ПрочитатьJSON(JSON);
	
	СтруктураДанных.Версия = Данные.tag_name;

	Для Каждого Файл Из Данные.assets Цикл
		
		Если Найти(НРег(Файл.Name), ".epf") > 0 Тогда
			СтруктураДанных.СсылкаНаСкачивание = Файл.browser_download_url;
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат СтруктураДанных;

КонецФункции

#КонецОбласти