

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("АдресЗначения", АдресЗначения); 
	
	Значение = ПолучитьИзВременногоХранилища(АдресЗначения);
	
	Для Каждого Колонка ИЗ Значение.Колонки Цикл
		ДобавитьКолонку(Колонка.Имя, Колонка.ТипЗначения, "ТаблицаЗначений");
	КонецЦикла; 
	
	ТаблицаЗначений.Загрузить(Значение);
			
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы
 &НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(); 
	
КонецПроцедуры  

&НаКлиенте
Процедура Перенести(Команда)
	
	ПоместитьТаблицуВХранилище();	
	Закрыть(Истина); 
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Функция ДобавитьКолонку(ИмяЭлемента, Тип, ИмяТаблицы);
			
	Реквизит = Новый РеквизитФормы(ИмяЭлемента, Тип, ИмяТаблицы);
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Реквизит);
	ИзменитьРеквизиты(МассивРеквизитов);
	
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Элементы[ИмяТаблицы]);		
	НовыйЭлемент.ПутьКДанным = ИмяТаблицы + "." + ИмяЭлемента;
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	
	Возврат Истина;
	
КонецФункции

Процедура ПоместитьТаблицуВХранилище() 
	ПоместитьВоВременноеХранилище(ТаблицаЗначений.Выгрузить(), АдресЗначения);
КонецПроцедуры

#КонецОбласти
