
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДеревоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоНаСервере()
	
	СтруктураХранения = ПолучитьСтруктуруХраненияБазыДанных(,Истина);
	Дерево = РеквизитФормыВЗначение("ДеревоХранения");

	Для Каждого ТекТаблица Из СтруктураХранения Цикл
		
		СтрокаДерева = Дерево.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева, ТекТаблица);
				
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоХранения");	

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДерево(Команда)
	ОбновитьДеревоНаСервере();
КонецПроцедуры
