#Область ОписаниеПеременных	
&НаКлиенте
Перем КонсольОбщиеМодулиКлиент;
#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТабличныйДокумент") Тогда
		ТабличныйДокумент = Параметры.ТабличныйДокумент;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КонсольОбщиеМодулиКлиент = ПолучитьФорму(ИмяОбработки() + ".Форма.ОбщиеМодулиКлиент");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("ТабличныйДокумент") Тогда
		
		// TODO переписать
		Закрыть();
		ОткрытьФорму(ИмяОбработки() + "Форма.ФормаТабличногоДокумента",Новый Структура("ТабличныйДокумент",Расшифровка));
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВычислитьСумму(Команда)
	КонсольОбщиеМодулиКлиент.ПоказатьРасчетЯчеек(ЭтотОбъект, ТабличныйДокумент);  // СтандартныеПодсистемыКлиент
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ИмяОбработки()
	
	Позиция1 = Найти(ИмяФормы, ".");
	Позиция2 = Найти(Сред(ИмяФормы, Позиция1 + 1), ".");
	
	Возврат Лев(ИмяФормы, Позиция1 + Позиция2 - 1); 
	
КонецФункции

#КонецОбласти

