&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КопироватьДанныеФормы(Параметры.Дерево, ДеревоНастроек);
	Элементы.ДеревоНастроек.ТекущаяСтрока = Параметры.ТекущаяСтрока;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбратьИЗакрыть();	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ВыбратьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИЗакрыть()
	
	Закрыть(Элементы.ДеревоНастроек.ТекущиеДанные.СписокПараметров);
	
КонецПроцедуры

