&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КопироватьДанныеФормы(Параметры.Дерево,ДеревоНастроек);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого ТекущаяСтрока Из ДеревоНастроек.ПолучитьЭлементы() Цикл
		
		Элементы.ДеревоНастроек.Развернуть(ТекущаяСтрока.ПолучитьИдентификатор());
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбратьИЗакрыть();	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ВыбратьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИЗакрыть()
	
	Закрыть(Элементы.ДеревоНастроек.ТекущиеДанные.СписокПараметров);
	
КонецПроцедуры

