#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Значение", Значение);
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда 
		
		//Элементы.ЗначениеСтрока.ПутьКДанным = "Значение";
		
		Если СтрНайти(Значение, Символы.ПС) > 0 Тогда
			Элементы.Значение.МногострочныйРежим = Истина;
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
