#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Выражение",Выражение);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВычислитьВыражение();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыражениеПриИзменении(Элемент)
	
	ВычислитьВыражение();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВычислитьВыражение()
	
	Результат.ПолучитьЭлементы().Очистить();
	Попытка
		Значение = Вычислить(Выражение);
		ДобавитьЗначение(Результат,Значение);
	Исключение
		Сообщить(ОписаниеОшибки())
	КонецПопытки;
	//ДобавитьЗначениеНаСервере(Результат,Значение);
	
КонецПроцедуры

&НаСервере
Функция ДобавитьЗначение(Знач Родитель, Знач Значение)

	НоваяСтрока = Родитель.ПолучитьЭлементы().Добавить();	
	НоваяСтрока.Свойство = "Значение";
	НоваяСтрока.Значение = Строка(Значение);
	НоваяСтрока.Тип = ТипЗнч(Значение);
	
	//Если ТипЗнч(Значение) = Тип("ДанныеФормыЭлементДерева") Тогда
	//	
	//	Колонки = ПолучитьКолонкиИзСтрокиДерева(Значение);
	//	
	//	Для Каждого Свойство Из Значение Цикл
	//		ДобавитьЗначение(НоваяСтрока,Свойство);	
	//	КонецЦикла;
	//КонецЕсли;
		
КонецФункции

&НаСервере
Функция ДобавитьЗначениеНаСервере(Знач Родитель, Знач Значение)

	НоваяСтрока = Родитель.ПолучитьЭлементы().Добавить();	
	НоваяСтрока.Свойство = "Значение";
	НоваяСтрока.Значение = Строка(Значение);
	НоваяСтрока.Тип = ТипЗнч(Значение);
			
КонецФункции

//Функция ПолучитьКолонкиИзСтрокиДерева(СтрокаДерева)

//	Дререво = ПолучитьДеревоИзСтроки(СтрокаДерева);	
//	рекви
//	Возврат Дререво.Колонки;
//	
//КонецФункции

//Функция ПолучитьДеревоИзСтроки(СтрокаДерева)

//	Дререво = ПолучитьДеревоИзСтроки(СтрокаДерева);	

//КонецФункции

#КонецОбласти
