#Область ОписаниеПеременных	
&НаКлиенте
Перем КонсольОбщиеМодулиКлиент;
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Текст") Тогда
		
		Текст = Параметры.Текст;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КонсольОбщиеМодулиКлиент = ПолучитьФорму("ВнешняяОбработка.КонсольЗапросовУправляемыеФормыSA.Форма.ОбщиеМодулиКлиент");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(Текст);

КонецПроцедуры

&НаКлиенте
Процедура Закомментировать(Команда)

	КонсольОбщиеМодулиКлиент.ДобавитьУбратьСимволыВНачалоТекстовогоДокумента(Элементы.Текст, "//")

КонецПроцедуры

&НаКлиенте
Процедура Раскомментировать(Команда)
	
	КонсольОбщиеМодулиКлиент.ДобавитьУбратьСимволыВНачалоТекстовогоДокумента(Элементы.Текст, "//",Истина)

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти
