#Область ОписаниеПеременных	
&НаКлиенте
Перем КонсольОбщиеМодулиКлиент;
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Текст") Тогда
		
		Текст = Параметры.Текст;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КонсольОбщиеМодулиКлиент = ПолучитьФорму(ИмяОбработки() + ".Форма.ОбщиеМодулиКлиент");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(Текст);

КонецПроцедуры

&НаКлиенте
Процедура Закомментировать(Команда)

	КонсольОбщиеМодулиКлиент.ДобавитьУбратьСимволыВНачалоТекстовогоДокумента(Элементы.Текст, "//")

КонецПроцедуры

&НаКлиенте
Процедура Раскомментировать(Команда)
	
	КонсольОбщиеМодулиКлиент.ДобавитьУбратьСимволыВНачалоТекстовогоДокумента(Элементы.Текст, "//", Истина)

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПереносСтроки(Команда)
	
	КонсольОбщиеМодулиКлиент.ДобавитьУбратьСимволыВНачалоТекстовогоДокумента(Элементы.Текст, "|")

КонецПроцедуры

&НаКлиенте
Процедура УбратьПереносСтроки(Команда)
	
	КонсольОбщиеМодулиКлиент.ДобавитьУбратьСимволыВНачалоТекстовогоДокумента(Элементы.Текст, "|", Истина)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ИмяОбработки() Экспорт
	
	Позиция1 = Найти(ИмяФормы, ".");
	Позиция2 = Найти(Сред(ИмяФормы, Позиция1 + 1), ".");
	
	Возврат Лев(ИмяФормы, Позиция1 + Позиция2 - 1); 
	
КонецФункции

#КонецОбласти
