#Область ОписаниеПеременных
&НаКлиенте
Перем ОсновнаяФорма;
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресХранилищаЗначений",АдресХранилищаЗначений) Тогда	
		ВывестиЗначенияНаФорму(Параметры.ИдентификаторЗначения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОсновнаяФорма = ПолучитьФорму("ВнешняяОбработка.КонсольЗапросовУправляемыеФормыSA.Форма");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура Подключаемый_ВыборРезультата(Элемент) Экспорт
	
	// TODO доделать
	Если ТипЗнч(Элемент) = Тип("ПолеФормы") И Элемент.Гиперссылка Тогда
		
		ИдентификаторЗначения = ЭтаФорма[Элемент.Имя];
		
	ИначеЕсли Элемент.ТекущийЭлемент.ГиперссылкаЯчейки Тогда
		
		ИдентификаторЗначения = ВладелецФормы.ИдентификаторЗначенияИзЭлемента(Элемент.Родитель, Элемент);
				
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторЗначения) Тогда
		ВывестиЗначенияНаФорму(ИдентификаторЗначения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ПоказатьЗначениеВОтдельномОкне(Команда)
		
	ОсновнаяФорма.ПоказатьЗначениеВОтдельномОкне(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиЗначенияНаФорму(ИдентификаторЗначения);

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	НеотображаемыеЗначения = ПолучитьИзВременногоХранилища(АдресХранилищаЗначений);
		
	Значение = НеотображаемыеЗначения.Получить(ИдентификаторЗначения);		

	МассивТаблиц = ОбработкаОбъект.ЗначениеВПроизвольнуюКоллекцию(Значение);
	
	ОбработкаОбъект.ДобавитьМассивЗначенийНаФому(ЭтаФорма,Элементы.ГруппаТаблицыЗначений,МассивТаблиц,Элементы.ДекорацияНетДанных);

КонецПроцедуры



#КонецОбласти
